<h1>Titanic</h1>
Este projeto foi criado por (This project was created by) <b>Moisés Peterson Gimenez</b>. <i>1º notebook</i>

Importando as bibliotecas que utilizarei neste projeto

Importing the libraries that I will use in this project

In [1]:
import numpy as np 
import pandas as pd
from sklearn.tree import DecisionTreeClassifier

Armazenando os dados de treino e teste em suas respectivas variáveis.

Storing training and test data in their respective variables

In [2]:
#Lendo os conjuntos de dados de teste e treino
train = pd.read_csv('D:/Usuarios/Usuario/Desktop/DataScience/train.csv')
test = pd.read_csv('D:/Usuarios/Usuario/Desktop/DataScience/test.csv')

Visualizando as primeiras linhas do dataset de treino


Viewing the first lines of the training dataset

In [3]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Eliminei campos que acredito não fazer diferenciação a priorização para a evacuação do navio. Campos eliminados: nome, cabine e ticket.
Comando drop() ► remover coluna
Comando axis=1 ► especificando coluna inteira
Comando inplace=True ► salvar alterações no próprio dataset (específico)

I eliminated fields that I believe do not differentiate the prioritization for the evacuation of the ship. Eliminated fields: name, cabin and ticket.
Drop () command ► remove column
Axis = 1 ► command specifying entire column
Inplace = True command ► save changes to the dataset itself (specific)

In [5]:
#Eliminando as colunas com nome, cabine e ticket.
train.drop(['Name', 'Ticket', 'Cabin'], axis=1, inplace=True)
test.drop(['Name', 'Ticket', 'Cabin'], axis=1, inplace=True)

Definir como números, colunas categóricas

Set as numbers, categorical columns

In [6]:
#Salvar novo dataframe a partir do comando One-hot encoding
new_data_train = pd.get_dummies(train)
new_data_test = pd.get_dummies(test)

Avaliando se houve as alterações de categorização

Assessing whether there were changes in categorization

In [7]:
#Primeiras linhas do dataset treino
new_data_train.head()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,1,0,3,22.0,1,0,7.2500,0,1,0,0,1
1,2,1,1,38.0,1,0,71.2833,1,0,1,0,0
2,3,1,3,26.0,0,0,7.9250,1,0,0,0,1
3,4,1,1,35.0,1,0,53.1000,1,0,0,0,1
4,5,0,3,35.0,0,0,8.0500,0,1,0,0,1

In [8]:
#Primeiras linhas do dataset teste
new_data_test.head()

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,892,3,34.5,0,0,7.8292,0,1,0,1,0
1,893,3,47.0,1,0,7.0000,1,0,0,0,1
2,894,2,62.0,0,0,9.6875,0,1,0,1,0
3,895,3,27.0,0,0,8.6625,0,1,0,0,1
4,896,3,22.0,1,1,12.2875,1,0,0,0,1

Avaliando nº de valores nulos em nosso conjunto de dataset.

Evaluating the number of null values in our dataset set.

In [9]:
#Avaliar valores nulos no conjunto de treino
new_data_train.isnull().sum().sort_values(ascending=False).head(10)

Age           177
Embarked_S      0
Embarked_Q      0
Embarked_C      0
Sex_male        0
Sex_female      0
Fare            0
Parch           0
SibSp           0
Pclass          0
dtype: int64

In [10]:
#Avaliar valores nulos no conjunto de teste
new_data_test.isnull().sum().sort_values(ascending=False).head(10)

Age           86
Fare           1
Embarked_S     0
Embarked_Q     0
Embarked_C     0
Sex_male       0
Sex_female     0
Parch          0
SibSp          0
Pclass         0
dtype: int64

Imputamos valores (média) para os campos da coluna Idade (treino e teste) e Preço (teste) nulos

We assign values (average) to the fields in the Age (training and test) and Price (test) column

In [11]:
#Imputação dos valores nulos - coluna idade
new_data_train['Age'].fillna(new_data_train['Age'].mean(), inplace=True)
new_data_test['Age'].fillna(new_data_test['Age'].mean(), inplace=True)
new_data_test['Fare'].fillna(new_data_test['Fare'].mean(), inplace=True)

Verificando se foram alterados valores nulos

Checking if null values have been changed

In [12]:
#Avaliar valores nulos no conjunto de treino
new_data_train.isnull().sum().sort_values(ascending=False).head(10)

Embarked_S    0
Embarked_Q    0
Embarked_C    0
Sex_male      0
Sex_female    0
Fare          0
Parch         0
SibSp         0
Age           0
Pclass        0
dtype: int64

In [13]:
#Avaliar valores nulos no conjunto de teste
new_data_test.isnull().sum().sort_values(ascending=False).head(10)

Embarked_S    0
Embarked_Q    0
Embarked_C    0
Sex_male      0
Sex_female    0
Fare          0
Parch         0
SibSp         0
Age           0
Pclass        0
dtype: int64

Após termos tratado os dados de treino e teste, daremos início ao modelo de Machine Learning. <b>Árvore de Decisão</b>

After we have processed the training and test data, we will start the Machine Learning model. <b> Decision Tree </b>

In [14]:
#Separando features e target para criação do modelo escolhido
x = new_data_train.drop('Survived', axis=1)
y = new_data_train['Survived']

In [15]:
#Criação do modelo
tree = DecisionTreeClassifier(max_depth=3, random_state=0)
tree.fit(x, y)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=3, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=0, splitter='best')

Avaliando nível de precisão de nosso modelo.

Assessing our model's level of accuracy.

In [16]:
#Score no conjunto de treino
tree.score(x, y)

0.8271604938271605

<b>Random Forest Regression</b>

Importando as bibliotecas

Importing the libraries

In [17]:
from sklearn.ensemble import RandomForestRegressor
from sklearn.datasets import make_regression

In [18]:
#Criação do modelo RandomForestRegressor
tree_rf = RandomForestRegressor()

In [19]:
model_rf = tree_rf.fit(x, y)
result_rf = model_rf.predict(x)

Avaliando nível de precisão de nosso modelo Random Forest Regressor

Assessing the level of accuracy of our Random Forest Regressor model

In [20]:
tree_rf.score(x, y)

0.9176414150129422

DataFrame final

Final DataFrame

In [21]:
submission = pd.DataFrame()
submission['PassengerId'] = new_data_test['PassengerId']
submission['Survived'] = tree.predict(new_data_test)

In [22]:
submission.to_csv('submission.csv', index=False)